Repository: kitknox/rootshell
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, ca, cs, da, de, es, fi, fr, he, hu, it, ja, ko, nb, nl, pl, pt_br, pt_pt, ro, sl, sv, uk, vi, zh_hans, zh_hant

source: What It Detects
ar: ما الذي يكتشفه
ca: Què detecta
cs: Co detekuje
da: Hvad den registrerer
de: Was erkannt wird
es: Qué detecta
fi: Mitä se tunnistaa
fr: Ce qui est détecté
he: מה הוא מזהה
hu: Mit ismer fel
it: Cosa rileva
ja: 検出できるもの
ko: 감지 대상
nb: Hva den gjenkjenner
nl: Wat het detecteert
pl: Co wykrywa
pt_br: O Que Ele Detecta
pt_pt: O Que Deteta
ro: Ce detectează
sl: Kaj zaznava
sv: Vad den identifierar
uk: Що виявляється
vi: Những gì được phát hiện
zh_hans: 可检测的内容
zh_hant: 可偵測的內容

source: What it does:
ar: ما يقوم به:
ca: Què fa:
cs: Co dělá:
da: Hvad den gør:
de: Was es macht:
es: Qué hace:
fi: Mitä se tekee:
fr: Ce que ça fait :
he: מה זה עושה:
hu: Mit csinál:
it: Cosa fa:
ja: 機能:
ko: 기능:
nb: Hva den gjør:
nl: Wat het doet:
pl: Co robi:
pt_br: O que faz:
pt_pt: O que faz:
ro: Ce face:
sl: Kaj počne:
sv: Vad den gör:
uk: Що вона робить:
vi: Chức năng:
zh_hans: 功能说明：
zh_hant: 功能說明：

source: What to Detect
ar: ما الذي يُكتشف
ca: Què s'ha de detectar
cs: Co detekovat
da: Hvad der skal registreres
de: Was erkannt wird
es: Qué detectar
fi: Mitä tunnistetaan
fr: Éléments à détecter
he: מה לזהות
hu: Mit ismerjen fel
it: Cosa rilevare
ja: 検出する対象
ko: 감지할 항목
nb: Hva som skal gjenkjennes
nl: Wat te detecteren
pl: Co wykrywać
pt_br: O Que Detectar
pt_pt: O Que Detetar
ro: Ce se detectează
sl: Kaj zaznavati
sv: Vad som ska identifieras
uk: Що виявляти
vi: Những gì cần phát hiện
zh_hans: 检测内容
zh_hant: 偵測項目

source: What You See
ar: ما الذي تراه
ca: Què veus
cs: Co uvidíte
da: Hvad du ser
de: Was Sie sehen
es: Qué verás
fi: Mitä näet
fr: Ce que vous voyez
he: מה רואים
hu: Mit lát
it: Cosa vedi
ja: 表示される内容
ko: 표시되는 내용
nb: Hva du ser
nl: Wat je ziet
pl: Co widzisz
pt_br: O Que Você Vê
pt_pt: O Que Vê
ro: Ce vedeți
sl: Kaj vidite
sv: Vad du ser
uk: Що ви бачите
vi: Những gì bạn thấy
zh_hans: 你会看到什么
zh_hant: 你會看到什麼

source: When an Apple Login Window or lock screen is detected, offer to type the saved password after confirmation.
ar: عند اكتشاف نافذة تسجيل دخول Apple أو شاشة قفل، اعرض كتابة كلمة المرور المحفوظة بعد التأكيد.
ca: Quan es detecti una finestra d'inici de sessió d'Apple o una pantalla de bloqueig, ofereix escriure la contrasenya desada després de confirmar-ho.
cs: Když je zjištěno přihlašovací okno Apple nebo zamknutá obrazovka, nabídne po potvrzení zadání uloženého hesla.
da: Når et Apple-loginvindue eller en låseskærm registreres, tilbydes det at skrive den gemte adgangskode efter bekræftelse.
de: Wenn ein Apple-Anmeldefenster oder ein Sperrbildschirm erkannt wird, wird nach einer Bestätigung angeboten, das gespeicherte Passwort einzugeben.
es: Cuando se detecta una ventana de inicio de sesión de Apple o una pantalla de bloqueo, se ofrece escribir la contraseña guardada tras confirmarlo.
fi: Kun Applen kirjautumisikkuna tai lukitusnäyttö havaitaan, tallennetun salasanan kirjoittamista tarjotaan vahvistuksen jälkeen.
fr: Lorsqu'une fenêtre de connexion Apple ou un écran verrouillé est détecté, propose de saisir le mot de passe enregistré après confirmation.
he: כאשר מזוהה חלון התחברות של Apple או מסך נעילה, תוצע הקלדת הסיסמה השמורה לאחר אישור.
hu: Ha Apple bejelentkezési ablak vagy zárolási képernyő észlelhető, megerősítés után felajánlja a mentett jelszó beírását.
it: Quando viene rilevata una finestra di login Apple o una schermata di blocco, propone di digitare la password salvata dopo la conferma.
ja: Apple のログインウィンドウやロック画面を検出したときに、確認のうえ保存済みのパスワードの入力を提案します。
ko: Apple 로그인 윈도우 또는 잠금 화면이 감지되면 확인 후 저장된 비밀번호 입력을 제안합니다.
nb: Når et Apple-innloggingsvindu eller en låst skjerm oppdages, tilbys det å skrive det lagrede passordet etter bekreftelse.
nl: Wanneer een Apple-inlogvenster of toegangsscherm wordt gedetecteerd, wordt na bevestiging aangeboden het bewaarde wachtwoord te typen.
pl: Gdy zostanie wykryte okno logowania Apple lub ekran blokady, po potwierdzeniu zaproponuje wpisanie zapisanego hasła.
pt_br: Quando uma Janela de Login da Apple ou tela bloqueada for detectada, oferece digitar a senha salva após a confirmação.
pt_pt: Quando uma janela de início de sessão da Apple ou um ecrã bloqueado for detetado, oferece escrever a palavra-passe guardada após confirmação.
ro: Când este detectată o fereastră de autentificare Apple sau un ecran de blocare, oferă introducerea parolei salvate după confirmare.
sl: Ko je zaznano Applovo prijavno okno ali zaklenjen zaslon, po potrditvi ponudi vnos shranjenega gesla.
sv: När ett Apple-inloggningsfönster eller en låsskärm upptäcks erbjuds det att skriva det sparade lösenordet efter bekräftelse.
uk: Коли виявлено вікно входу Apple або замкнений екран, після підтвердження буде запропоновано ввести збережений пароль.
vi: Khi phát hiện Cửa sổ đăng nhập của Apple hoặc màn hình khóa, đề nghị nhập mật khẩu đã lưu sau khi xác nhận.
zh_hans: 检测到 Apple 登录窗口或锁定屏幕时，在确认后提示输入已保存的密码。
zh_hant: 偵測到 Apple 登入視窗或鎖定畫面時，會在確認後提議輸入已儲存的密碼。

source: When disabled, uses exec to replace the shell with the command.
ar: عند التعطيل، يستخدم exec لاستبدال واجهة الأوامر بالأمر.
ca: Quan està desactivat, utilitza exec per substituir el terminal per l'ordre.
cs: Když je zakázáno, používá exec k nahrazení shellu příkazem.
da: Når deaktiveret, bruges exec til at erstatte shellen med kommandoen.
de: Bei Deaktivierung wird exec verwendet, um die Shell durch den Befehl zu ersetzen.
es: Cuando está deshabilitado, usa exec para reemplazar el shell con el comando.
fi: Kun pois käytöstä, käyttää exec-komentoa korvaamaan komentotulkin komennolla.
fr: Lorsque désactivé, utilise exec pour remplacer le shell par la commande.
he: כאשר מושבת, משתמש ב-exec להחלפת המעטפת בפקודה.
hu: Ha le van tiltva, exec-et használ a shell paranccsal való helyettesítéséhez.
it: Se disattivato, utilizza exec per sostituire la shell con il comando.
ja: 無効の場合、execを使用してシェルをコマンドに置き換えます。
ko: 비활성화하면 exec를 사용하여 셸을 명령으로 대체합니다.
nb: Når deaktivert, brukes exec for å erstatte skallet med kommandoen.
nl: Wanneer uitgeschakeld, wordt exec gebruikt om de shell te vervangen door het commando.
pl: Po wyłączeniu używa exec, aby zastąpić powłokę poleceniem.
pt_br: Quando desativado, usa exec para substituir o shell pelo comando.
pt_pt: Quando desativado, utiliza exec para substituir a shell pelo comando.
ro: Când este dezactivat, folosește exec pentru a înlocui shell-ul cu comanda.
sl: Ko je onemogočeno, se uporabi exec za zamenjavo lupine z ukazom.
sv: När inaktiverat används exec för att ersätta skalet med kommandot.
uk: Коли вимкнено, використовує exec для заміни оболонки командою.
vi: Khi tắt, sử dụng exec để thay thế shell bằng lệnh.
zh_hans: 禁用时，使用 exec 以命令替换 Shell。
zh_hant: 停用時，使用 exec 以指令取代 Shell。

source: When enabled, SSH connections use the OpenSSH/libssh2 public-key flow: offer the public key first, then sign after the server accepts it. This can improve compatibility with some routers and embedded SSH servers, but adds one authentication round trip.
ar: عند التفعيل، تستخدم اتصالات SSH تدفق المفاتيح العامة الخاص بـ OpenSSH/libssh2: عرض المفتاح العام أولًا، ثم التوقيع بعد قبول الخادم له. قد يُحسّن ذلك التوافق مع بعض الموجِّهات وخوادم SSH المضمَّنة، لكنه يضيف رحلة مصادقة إضافية.
ca: Quan està activat, les connexions SSH fan servir el flux de clau pública d’OpenSSH/libssh2: primer s’ofereix la clau pública i, després que el servidor l’accepti, se signa. Això pot millorar la compatibilitat amb alguns routers i servidors SSH integrats, però afegeix un viatge d’anada i tornada d’autenticació.
cs: Pokud je zapnuto, SSH připojení používají tok veřejného klíče OpenSSH/libssh2: nejprve se nabídne veřejný klíč a podpis se vytvoří až po přijetí serverem. Může to zlepšit kompatibilitu s některými routery a vestavěnými SSH servery, ale přidává jednu cestu navíc při ověřování.
da: Når dette er aktiveret, bruger SSH-forbindelser OpenSSH/libssh2-flowet for offentlig nøgle: tilbyd den offentlige nøgle først, og signér derefter, når serveren har accepteret den. Det kan forbedre kompatibiliteten med visse routere og indbyggede SSH-servere, men tilføjer en ekstra godkendelsesrundtur.
de: Wenn aktiviert, verwenden SSH-Verbindungen den OpenSSH/libssh2-Public-Key-Ablauf: Zuerst wird der öffentliche Schlüssel angeboten und erst nach Akzeptanz durch den Server signiert. Das kann die Kompatibilität mit manchen Routern und eingebetteten SSH-Servern verbessern, fügt aber einen zusätzlichen Authentifizierungs-Roundtrip hinzu.
es: Cuando está activado, las conexiones SSH usan el flujo de clave pública de OpenSSH/libssh2: primero se ofrece la clave pública y se firma solo después de que el servidor la acepte. Esto puede mejorar la compatibilidad con algunos routers y servidores SSH integrados, pero añade un viaje de ida y vuelta de autenticación.
fi: Kun käytössä, SSH-yhteydet käyttävät OpenSSH/libssh2-julkisen avaimen kulkua: tarjotaan ensin julkinen avain ja allekirjoitetaan vasta, kun palvelin on hyväksynyt sen. Tämä voi parantaa yhteensopivuutta joidenkin reitittimien ja sulautettujen SSH-palvelimien kanssa, mutta lisää yhden todennuksen edestakaisen kierroksen.
fr: Lorsqu’elle est activée, les connexions SSH utilisent le flux de clé publique d’OpenSSH/libssh2 : la clé publique est d’abord proposée, puis signée après acceptation par le serveur. Cela peut améliorer la compatibilité avec certains routeurs et serveurs SSH embarqués, mais ajoute un aller-retour d’authentification supplémentaire.
he: כאשר מופעל, חיבורי SSH משתמשים בזרימת המפתח הציבורי של OpenSSH/libssh2: תחילה מציעים את המפתח הציבורי, ולאחר אישור השרת חותמים. זה יכול לשפר תאימות עם חלק מהנתבים ושרתי SSH מוטמעים, אך מוסיף סבב אימות נוסף.
hu: Bekapcsolva az SSH-kapcsolatok az OpenSSH/libssh2 nyilvános kulcsú folyamatát használják: először felajánlják a nyilvános kulcsot, és csak a kiszolgáló elfogadása után írnak alá. Ez javíthatja a kompatibilitást egyes routerekkel és beágyazott SSH-kiszolgálókkal, de egy plusz hitelesítési körutat ad hozzá.
it: Se attivo, le connessioni SSH usano il flusso a chiave pubblica di OpenSSH/libssh2: prima viene offerta la chiave pubblica e poi si firma quando il server l’accetta. Può migliorare la compatibilità con alcuni router e server SSH integrati, ma aggiunge un round trip di autenticazione.
ja: 有効にすると、SSH 接続は OpenSSH/libssh2 の公開鍵フローを使用します。まず公開鍵を提示し、サーバーが受け入れた後に署名します。一部のルーターや組み込み SSH サーバーとの互換性が向上することがありますが、認証のラウンドトリップが 1 回追加されます。
ko: 활성화하면 SSH 연결이 OpenSSH/libssh2 공개 키 흐름을 사용합니다. 먼저 공개 키를 제시한 뒤, 서버가 수락한 후에 서명합니다. 일부 라우터 및 임베디드 SSH 서버와의 호환성이 향상될 수 있지만 인증 왕복이 한 번 더 추가됩니다.
nb: Når dette er aktivert, bruker SSH-tilkoblinger OpenSSH/libssh2-flyten for offentlig nøkkel: tilby den offentlige nøkkelen først, og signer deretter når serveren godtar den. Det kan forbedre kompatibiliteten med enkelte rutere og innebygde SSH-tjenere, men legger til en ekstra autentiseringsrunde.
nl: Wanneer ingeschakeld gebruiken SSH-verbindingen de OpenSSH/libssh2-stroom voor openbare sleutels: bied eerst de openbare sleutel aan en onderteken pas nadat de server deze heeft geaccepteerd. Dit kan de compatibiliteit met sommige routers en ingebouwde SSH-servers verbeteren, maar voegt één extra authenticatie-rondrit toe.
pl: Po włączeniu połączenia SSH korzystają z przepływu klucza publicznego OpenSSH/libssh2: najpierw przedstawiany jest klucz publiczny, a podpis powstaje dopiero po zaakceptowaniu przez serwer. Może to poprawić zgodność z niektórymi routerami i wbudowanymi serwerami SSH, ale dodaje jedno dodatkowe okrążenie uwierzytelniania.
pt_br: Quando ativado, as conexões SSH usam o fluxo de chave pública do OpenSSH/libssh2: primeiro oferecem a chave pública e só assinam depois que o servidor a aceitar. Isso pode melhorar a compatibilidade com alguns roteadores e servidores SSH embarcados, mas acrescenta uma ida e volta de autenticação.
pt_pt: Quando ativado, as ligações SSH usam o fluxo de chave pública do OpenSSH/libssh2: primeiro oferecem a chave pública e só assinam depois de o servidor a aceitar. Isto pode melhorar a compatibilidade com alguns routers e servidores SSH embebidos, mas acrescenta uma ida e volta de autenticação.
ro: Când este activat, conexiunile SSH folosesc fluxul de cheie publică OpenSSH/libssh2: oferă mai întâi cheia publică, iar apoi semnează după ce serverul o acceptă. Acest lucru poate îmbunătăți compatibilitatea cu unele routere și servere SSH integrate, dar adaugă o rundă suplimentară de autentificare.
sl: Ko je omogočeno, povezave SSH uporabljajo tok javnega ključa OpenSSH/libssh2: najprej se ponudi javni ključ, podpis pa se izvede šele, ko ga strežnik sprejme. To lahko izboljša združljivost z nekaterimi usmerjevalniki in vgrajenimi strežniki SSH, doda pa en dodaten obhod overjanja.
sv: När detta är aktiverat använder SSH-anslutningar OpenSSH/libssh2-flödet för publika nycklar: erbjud först den publika nyckeln och signera sedan när servern har accepterat den. Det kan förbättra kompatibiliteten med vissa routrar och inbäddade SSH-servrar, men lägger till en extra autentiseringsrunda.
uk: Якщо ввімкнено, з’єднання SSH використовують потік відкритого ключа OpenSSH/libssh2: спочатку надається відкритий ключ, а підпис створюється лише після того, як сервер його прийме. Це може покращити сумісність із деякими маршрутизаторами та вбудованими SSH-серверами, але додає один додатковий цикл автентифікації.
vi: Khi bật, các kết nối SSH sử dụng luồng khóa công khai của OpenSSH/libssh2: cung cấp khóa công khai trước, sau đó ký khi máy chủ chấp nhận. Điều này có thể cải thiện khả năng tương thích với một số bộ định tuyến và máy chủ SSH nhúng, nhưng thêm một lượt xác thực khứ hồi.
zh_hans: 启用后,SSH 连接使用 OpenSSH/libssh2 的公钥流程:先提供公钥,服务器接受后再签名。这可以改善与某些路由器和嵌入式 SSH 服务器的兼容性,但会增加一次身份验证往返。
zh_hant: 啟用後,SSH 連線採用 OpenSSH/libssh2 的公開金鑰流程:先提供公開金鑰,待伺服器接受後再簽署。這可改善與某些路由器及嵌入式 SSH 伺服器的相容性,但會多一次身分驗證往返。

source: When enabled, the drawer starts open each time the keyboard appears.
ar: عند التفعيل، يبدأ الدرج مفتوحاً في كل مرة تظهر فيها لوحة المفاتيح.
ca: Quan està activat, el calaix s'obre cada vegada que apareix el teclat.
cs: Když je povoleno, zásuvka se otevře pokaždé, když se objeví klávesnice.
da: Når aktiveret, starter skuffen åben, hver gang tastaturet vises.
de: Bei Aktivierung öffnet sich die Schublade jedes Mal, wenn die Tastatur erscheint.
es: Cuando está habilitado, el cajón se abre cada vez que aparece el teclado.
fi: Kun käytössä, laatikko avautuu aina näppäimistön ilmestyessä.
fr: Lorsque activé, le tiroir s'ouvre à chaque apparition du clavier.
he: כאשר מופעל, המגירה נפתחת בכל פעם שהמקלדת מופיעה.
hu: Ha engedélyezve van, a fiók nyitva indul minden alkalommal, amikor a billentyűzet megjelenik.
it: Se attivato, il cassetto si apre ogni volta che appare la tastiera.
ja: 有効にすると、キーボードが表示されるたびにドロワーが開いた状態で始まります。
ko: 활성화하면 키보드가 나타날 때마다 서랍이 열린 상태로 시작됩니다.
nb: Når aktivert, starter skuffen åpen hver gang tastaturet vises.
nl: Wanneer ingeschakeld, opent de lade telkens wanneer het toetsenbord verschijnt.
pl: Po włączeniu szuflada otwiera się za każdym razem, gdy pojawia się klawiatura.
pt_br: Quando ativado, a gaveta inicia aberta cada vez que o teclado aparece.
pt_pt: Quando ativado, a gaveta abre sempre que o teclado aparece.
ro: Când este activat, sertarul se deschide de fiecare dată când apare tastatura.
sl: Ko je omogočeno, se predal odpre vsakič, ko se pojavi tipkovnica.
sv: När aktiverat öppnas lådan varje gång tangentbordet visas.
uk: Коли увімкнено, панель відкривається щоразу при появі клавіатури.
vi: Khi bật, ngăn kéo sẽ mở mỗi khi bàn phím xuất hiện.
zh_hans: 启用后，每次键盘出现时抽屉栏默认打开。
zh_hant: 啟用後，每次鍵盤出現時抽屜列會預設開啟。

source: When Focused
ar: عند التركيز
ca: Quan està enfocat
cs: Při zaměření
da: Når fokuseret
de: Bei Fokus
es: Cuando está enfocado
fi: Kun aktiivinen
fr: Quand actif
he: כשבמיקוד
hu: Fókuszban
it: Quando attivo
ja: フォーカス時
ko: 포커스 시
nb: Når fokusert
nl: Bij focus
pl: Gdy aktywne
pt_br: Quando em foco
pt_pt: Quando em foco
ro: Când este focalizat
sl: Ko je v fokusu
sv: Vid fokus
uk: При фокусі
vi: Khi được chọn
zh_hans: 聚焦时
zh_hant: 取得焦點時

source: When In Use
ar: عند الاستخدام
ca: Mentre s'utilitza l'aplicació
cs: Při používání
da: Når appen bruges
de: Bei Verwendung der App
es: Mientras se usa la app
fi: Käytön aikana
fr: Lors de l'utilisation de l'app
he: בזמן השימוש
hu: Használat közben
it: Solo se in uso
ja: 使用中のみ
ko: 사용 중일 때
nb: Når appen brukes
nl: Tijdens gebruik
pl: Podczas używania aplikacji
pt_br: Ao Usar o App
pt_pt: Durante a Utilização
ro: La utilizare
sl: Med uporabo aplikacije
sv: När appen används
uk: Під час використання
vi: Khi sử dụng
zh_hans: 使用期间
zh_hant: 使用期間

source: When Pointer Reaches Edge
ar: عند وصول المؤشر إلى الحافة
ca: Quan el punter arriba a la vora
cs: Když ukazatel dosáhne okraje
da: Når markøren når kanten
de: Wenn der Zeiger den Rand erreicht
es: Cuando el puntero llega al borde
fi: Kun osoitin saavuttaa reunan
fr: Quand le pointeur atteint le bord
he: כשהסמן מגיע לקצה
hu: Amikor a mutató eléri a szélét
it: Quando il puntatore raggiunge il bordo
ja: ポインタが端に達したとき
ko: 포인터가 가장자리에 닿을 때
nb: Når pekeren når kanten
nl: Wanneer de aanwijzer de rand bereikt
pl: Gdy wskaźnik dotrze do krawędzi
pt_br: Quando o Ponteiro Atinge a Borda
pt_pt: Quando o ponteiro atinge a margem
ro: Când cursorul atinge marginea
sl: Ko kazalec doseže rob
sv: När pekaren når kanten
uk: Коли вказівник досягає краю
vi: Khi con trỏ chạm cạnh màn hình
zh_hans: 指针到达边缘时
zh_hant: 指標到達邊緣時

source: When running git commit, generate a message from staged changes using the selected AI model
ar: عند تنفيذ أمر git commit، يتم إنشاء رسالة من التغييرات المُدرجة باستخدام نموذج الذكاء الاصطناعي المحدد
ca: En executar git commit, genera un missatge a partir dels canvis preparats utilitzant el model d'IA seleccionat
cs: Při spuštění git commit vygenerovat zprávu z připravených změn pomocí vybraného modelu AI
da: Ved git commit genereres en besked ud fra klargjorte ændringer med den valgte AI-model
de: Beim Ausführen von git commit wird aus den vorgemerkten Änderungen mithilfe des ausgewählten KI-Modells eine Nachricht erstellt
es: Al ejecutar git commit, generar un mensaje a partir de los cambios preparados usando el modelo de IA seleccionado
fi: Luo git commit -komennon yhteydessä viesti valmistelluista muutoksista valitun tekoälymallin avulla
fr: Lors de l'exécution de git commit, générer un message à partir des modifications indexées en utilisant le modèle d'IA sélectionné
he: בעת הרצת git commit, יצירת הודעה מהשינויים המוכנים באמצעות מודל ה-AI שנבחר
hu: A git commit futtatásakor üzenet generálása az előkészített változtatásokból a kiválasztott AI-modell segítségével
it: Durante l'esecuzione di git commit, genera un messaggio dalle modifiche in staging utilizzando il modello di IA selezionato
ja: git commit実行時に、選択したAIモデルを使用してステージ済みの変更からメッセージを生成します
ko: git commit 실행 시 선택한 AI 모델을 사용하여 스테이징된 변경 사항으로 메시지를 생성합니다
nb: Når du kjører git commit, generer en melding fra klargjorte endringer ved hjelp av den valgte AI-modellen
nl: Genereer bij het uitvoeren van git commit een bericht op basis van klaargezette wijzigingen met het geselecteerde AI-model
pl: Podczas wykonywania git commit wygeneruj wiadomość na podstawie zatwierdzonych zmian, używając wybranego modelu AI
pt_br: Ao executar git commit, gerar uma mensagem a partir das alterações preparadas usando o modelo de IA selecionado
pt_pt: Ao executar git commit, gerar uma mensagem a partir das alterações preparadas utilizando o modelo de IA selecionado
ro: La executarea git commit, generează un mesaj din modificările pregătite folosind modelul de IA selectat
sl: Pri izvajanju git commit ustvari sporočilo iz pripravljenih sprememb z uporabo izbranega modela UI
sv: Vid git commit, generera ett meddelande från förändrade filer med den valda AI-modellen
uk: Під час виконання git commit генерувати повідомлення на основі підготовлених змін за допомогою обраної моделі ШІ
vi: Khi chạy git commit, tạo thông điệp từ các thay đổi đã stage bằng mô hình AI đã chọn
zh_hans: 运行 git commit 时，使用所选 AI 模型根据暂存的更改生成提交信息
zh_hant: 執行 git commit 時，使用所選的 AI 模型根據暫存的變更產生提交訊息

source: When you tap Generate, the system will prompt you to connect your security key via USB-C, NFC, or Lightning.
ar: عند الضغط على "إنشاء"، سيطلب منك النظام توصيل مفتاح الأمان عبر USB-C أو NFC أو Lightning.
ca: Quan toqueu Generar, el sistema us demanarà que connecteu la vostra clau de seguretat via USB-C, NFC o Lightning.
cs: Když klepnete na Vygenerovat, systém vás vyzve k připojení bezpečnostního klíče přes USB-C, NFC nebo Lightning.
da: Når du trykker på Generer, vil systemet bede dig om at tilslutte din sikkerhedsnøgle via USB-C, NFC eller Lightning.
de: Wenn Sie auf Generieren tippen, werden Sie vom System aufgefordert, Ihren Sicherheitsschlüssel über USB-C, NFC oder Lightning zu verbinden.
es: Al tocar Generar, el sistema le pedirá que conecte su clave de seguridad mediante USB-C, NFC o Lightning.
fi: Kun napautat Luo, järjestelmä pyytää yhdistämään turva-avaimen USB-C:n, NFC:n tai Lightningin kautta.
fr: Lorsque vous appuyez sur Générer, le système vous invitera à connecter votre clé de sécurité via USB-C, NFC ou Lightning.
he: כאשר תלחץ על יצירה, המערכת תבקש ממך לחבר את מפתח האבטחה שלך דרך USB-C, NFC, או Lightning.
hu: A Generálás megnyomásakor a rendszer kérni fogja a biztonsági kulcs csatlakoztatását USB-C, NFC vagy Lightning segítségével.
it: Toccando Genera, il sistema chiederà di collegare la chiave di sicurezza tramite USB-C, NFC o Lightning.
ja: 生成をタップすると、USB-C、NFC、またはLightning経由でセキュリティキーを接続するよう求められます。
ko: 생성을 탭하면 USB-C, NFC 또는 Lightning을 통해 보안 키를 연결하라는 메시지가 표시됩니다.
nb: Når du trykker Generer, vil systemet be deg om å koble til sikkerhetsnøkkelen din via USB-C, NFC eller Lightning.
nl: Wanneer u op Genereren tikt, wordt u gevraagd uw beveiligingssleutel aan te sluiten via USB-C, NFC of Lightning.
pl: Po stuknięciu Generuj system poprosi o podłączenie klucza bezpieczeństwa przez USB-C, NFC lub Lightning.
pt_br: Ao tocar em Gerar, o sistema solicitará que você conecte sua chave de segurança via USB-C, NFC ou Lightning.
pt_pt: Ao tocar em Gerar, o sistema irá pedir-lhe para ligar a sua chave de segurança via USB-C, NFC ou Lightning.
ro: Când apăsați Generare, sistemul vă va solicita să conectați cheia de securitate prin USB-C, NFC sau Lightning.
sl: Ko tapnete Ustvari, vas bo sistem pozval, da povežete varnostni ključ prek USB-C, NFC ali Lightning.
sv: När du trycker på Generera uppmanas du att ansluta din säkerhetsnyckel via USB-C, NFC eller Lightning.
uk: Коли ви натиснете «Згенерувати», система запропонує підключити ваш ключ безпеки через USB-C, NFC або Lightning.
vi: Khi bạn nhấn Tạo, hệ thống sẽ nhắc bạn kết nối khóa bảo mật qua USB-C, NFC hoặc Lightning.
zh_hans: 点击生成后，系统将提示您通过 USB-C、NFC 或 Lightning 连接安全密钥。
zh_hant: 點選「產生」後，系統將提示您透過 USB-C、NFC 或 Lightning 連接安全金鑰。
